MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
extern volatile ADTBL9BITS ADTBL9bits __attribute__((__sfr__));

#define ADTBL10 ADTBL10
extern volatile uint16_t ADTBL10 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL10BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL10BITS;
extern volatile ADTBL10BITS ADTBL10bits __attribute__((__sfr__));

#define ADTBL11 ADTBL11
extern volatile uint16_t ADTBL11 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL11BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL11BITS;
extern volatile ADTBL11BITS ADTBL11bits __attribute__((__sfr__));

#define ADTBL12 ADTBL12
extern volatile uint16_t ADTBL12 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL12BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL12BITS;
extern volatile ADTBL12BITS ADTBL12bits __attribute__((__sfr__));

#define ADTBL13 ADTBL13
extern volatile uint16_t ADTBL13 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL13BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL13BITS;
extern volatile ADTBL13BITS ADTBL13bits __attribute__((__sfr__));

#define ADTBL14 ADTBL14
extern volatile uint16_t ADTBL14 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL14BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL14BITS;
extern volatile ADTBL14BITS ADTBL14bits __attribute__((__sfr__));

#define ADTBL15 ADTBL15
extern volatile uint16_t ADTBL15 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL15BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL15BITS;
extern volatile ADTBL15BITS ADTBL15bits __attribute__((__sfr__));

#define ADTBL16 ADTBL16
extern volatile uint16_t ADTBL16 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL16BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL16BITS;
extern volatile ADTBL16BITS ADTBL16bits __attribute__((__sfr__));

#define ADTBL17 ADTBL17
extern volatile uint16_t ADTBL17 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL17BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL17BITS;
extern volatile ADTBL17BITS ADTBL17bits __attribute__((__sfr__));

#define ADTBL18 ADTBL18
extern volatile uint16_t ADTBL18 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL18BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL18BITS;
extern volatile ADTBL18BITS ADTBL18bits __attribute__((__sfr__));

#define ADTBL19 ADTBL19
extern volatile uint16_t ADTBL19 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL19BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL19BITS;
extern volatile ADTBL19BITS ADTBL19bits __attribute__((__sfr__));

#define ADTBL20 ADTBL20
extern volatile uint16_t ADTBL20 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL20BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL20BITS;
extern volatile ADTBL20BITS ADTBL20bits __attribute__((__sfr__));

#define ADTBL21 ADTBL21
extern volatile uint16_t ADTBL21 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL21BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL21BITS;
extern volatile ADTBL21BITS ADTBL21bits __attribute__((__sfr__));

#define ADTBL22 ADTBL22
extern volatile uint16_t ADTBL22 __attribute__((__sfr__));
__extension__ typedef struct tagADTBL22BITS {
  union {
    struct {
      uint16_t ADCH:7;
      uint16_t :7;
      uint16_t DIFF:1;
      uint16_t UCTMU:1;
    };
    struct {
      uint16_t ADCH0:1;
      uint16_t ADCH1:1;
      uint16_t ADCH2:1;
      uint16_t ADCH3:1;
      uint16_t ADCH4:1;
      uint16_t ADCH5:1;
      uint16_t ADCH6:1;
    };
  };
} ADTBL22BITS;
extern volatile ADTBL22BITS ADTBL22bits __attribute__((__sfr__));

