MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
extern volatile DMACH5BITS DMACH5bits __attribute__((__sfr__));

#define DMAINT5 DMAINT5
extern volatile uint16_t DMAINT5 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT5BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:6;
      uint16_t :1;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
    };
  };
} DMAINT5BITS;
extern volatile DMAINT5BITS DMAINT5bits __attribute__((__sfr__));

#define DMASRC5 DMASRC5
extern volatile uint16_t DMASRC5 __attribute__((__sfr__));
#define DMADST5 DMADST5
extern volatile uint16_t DMADST5 __attribute__((__sfr__));
#define DMACNT5 DMACNT5
extern volatile uint16_t DMACNT5 __attribute__((__sfr__));
#define ADL3CON ADL3CON
extern volatile uint32_t ADL3CON __attribute__((__sfr__));
#define ADL3CONL ADL3CONL
extern volatile uint16_t ADL3CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL3CONLBITS {
  union {
    struct {
      uint16_t SLSIZE:6;
      uint16_t :1;
      uint16_t THSRC:1;
      uint16_t SLTSRC:5;
      uint16_t SLENCLR:1;
      uint16_t SAMP:1;
      uint16_t SLEN:1;
    };
    struct {
      uint16_t SLSIZE0:1;
      uint16_t SLSIZE1:1;
      uint16_t SLSIZE2:1;
      uint16_t SLSIZE3:1;
      uint16_t SLSIZE4:1;
      uint16_t SLSIZE5:1;
      uint16_t :2;
      uint16_t SLTSRC0:1;
      uint16_t SLTSRC1:1;
      uint16_t SLTSRC2:1;
      uint16_t SLTSRC3:1;
      uint16_t SLTSRC4:1;
    };
  };
} ADL3CONLBITS;
extern volatile ADL3CONLBITS ADL3CONLbits __attribute__((__sfr__));

#define ADL3CONH ADL3CONH
extern volatile uint16_t ADL3CONH __attribute__((__sfr__));
__extension__ typedef struct tagADL3CONHBITS {
  union {
    struct {
      uint16_t SAMC:5;
      uint16_t MULCHEN:1;
      uint16_t :1;
      uint16_t CTMEN:1;
      uint16_t CM:3;
      uint16_t WM:2;
      uint16_t SLINT:2;
      uint16_t ASEN:1;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t :3;
      uint16_t CM0:1;
      uint16_t CM1:1;
      uint16_t CM2:1;
      uint16_t WM0:1;
      uint16_t WM1:1;
      uint16_t SLINT0:1;
      uint16_t SLINT1:1;
    };
  };
} ADL3CONHBITS;
extern volatile ADL3CONHBITS ADL3CONHbits __attribute__((__sfr__));

#define ADL3PTR ADL3PTR
extern volatile uint16_t ADL3PTR __attribute__((__sfr__));
__extension__ typedef struct tagADL3PTRBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t ADNEXT:7;
    };
    struct {
      uint16_t :8;
      uint16_t ADNEXT0:1;
      uint16_t ADNEXT1:1;
      uint16_t ADNEXT2:1;
      uint16_t ADNEXT3:1;
      uint16_t ADNEXT4:1;
      uint16_t ADNEXT5:1;
      uint16_t ADNEXT6:1;
    };
  };
} ADL3PTRBITS;
extern volatile ADL3PTRBITS ADL3PTRbits __attribute__((__sfr__));

#define ADL3STAT ADL3STAT
extern volatile uint16_t ADL3STAT __attribute__((__sfr__));
typedef struct tagADL3STATBITS {
  uint16_t :5;
  uint16_t ADLIF:1;
  uint16_t :1;
  uint16_t ADTDLY:1;
  uint16_t :6;
  uint16_t LBUSY:1;
  uint16_t ADTACT:1;
} ADL3STATBITS;
extern volatile ADL3STATBITS ADL3STATbits __attribute__((__sfr__));

#define ADTH3L ADTH3L
extern volatile uint16_t ADTH3L __attribute__((__sfr__));
typedef struct tagADTH3LBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH3LBITS;
extern volatile ADTH3LBITS ADTH3Lbits __attribute__((__sfr__));

#define ADTH3H ADTH3H
extern volatile uint16_t ADTH3H __attribute__((__sfr__));
typedef struct tagADTH3HBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH3HBITS;
extern volatile ADTH3HBITS ADTH3Hbits __attribute__((__sfr__));

#define ADL3MSEL ADL3MSEL
extern volatile uint64_t ADL3MSEL __attribute__((__sfr__));
#define ADL3MSEL0 ADL3MSEL0
extern volatile uint16_t ADL3MSEL0 __attribute__((__sfr__));
typedef struct tagADL3MSEL0BITS {
  uint16_t :15;
  uint16_t MSEL15:1;
} ADL3MSEL0BITS;
extern volatile ADL3MSEL0BITS ADL3MSEL0bits __attribute__((__sfr__));

#define ADL3MSEL1 ADL3MSEL1
extern volatile uint16_t ADL3MSEL1 __attribute__((__sfr__));
typedef struct tagADL3MSEL1BITS {
  uint16_t MSEL16:1;
  uint16_t MSEL17:1;
  uint16_t MSEL18:1;
  uint16_t MSEL19:1;
  uint16_t MSEL20:1;
  uint16_t MSEL21:1;
  uint16_t MSEL22:1;
  uint16_t MSEL23:1;
  uint16_t MSEL24:1;
  uint16_t MSEL25:1;
  uint16_t MSEL26:1;
  uint16_t MSEL27:1;
  uint16_t MSEL28:1;
  uint16_t MSEL29:1;
  uint16_t MSEL30:1;
  uint16_t MSEL31:1;
} ADL3MSEL1BITS;
extern volatile ADL3MSEL1BITS ADL3MSEL1bits __attribute__((__sfr__));

#define ADL3MSEL2 ADL3MSEL2
extern volatile uint16_t ADL3MSEL2 __attribute__((__sfr__));
typedef struct tagADL3MSEL2BITS {
  uint16_t MSEL32:1;
  uint16_t MSEL33:1;
  uint16_t MSEL34:1;
  uint16_t MSEL35:1;
  uint16_t MSEL36:1;
  uint16_t MSEL37:1;
  uint16_t MSEL38:1;
  uint16_t MSEL39:1;
  uint16_t MSEL40:1;
  uint16_t MSEL41:1;
  uint16_t MSEL42:1;
  uint16_t MSEL43:1;
  uint16_t MSEL44:1;
  uint16_t MSEL45:1;
  uint16_t MSEL46:1;
  uint16_t MSEL47:1;
} ADL3MSEL2BITS;
extern volatile ADL3MSEL2BITS ADL3MSEL2bits __attribute__((__sfr__));

#define ADL3MSEL3 ADL3MSEL3
extern volatile uint16_t ADL3MSEL3 __attribute__((__sfr__));
typedef struct tagADL3MSEL3BITS {
  uint16_t MSEL48:1;
  uint16_t MSEL49:1;
} ADL3MSEL3BITS;
extern volatile ADL3MSEL3BITS ADL3MSEL3bits __attribute__((__sfr__));

#define DAC1CON DAC1CON
extern volatile uint16_t DAC1CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC1CONBITS {
  union {
    struct {
      uint16_t DACREF:2;
      uint16_t DACTSEL:5;
      uint16_t :1;
      uint16_t DACTRIG:1;
      uint16_t :2;
      uint16_t DACFM:1;
      uint16_t DACSLP:1;
      uint16_t DACSIDL:1;
      uint16_t :1;
      uint16_t DACEN:1;
    };
    struct {
      uint16_t REFSEL0:1;
      uint16_t REFSEL1:1;
      uint16_t DACTSEL0:1;
      uint16_t DACTSEL1:1;
      uint16_t DACTSEL2:1;
      uint16_t DACTSEL3:1;
      uint16_t DACTSEL4:1;
    };
  };
} DAC1CONBITS;
extern volatile DAC1CONBITS DAC1CONbits __attribute__((__sfr__));

#define DAC1DAT DAC1DAT
extern volatile uint16_t DAC1DAT __attribute__((__sfr__));
#define DAC2CON DAC2CON
extern volatile uint16_t DAC2CON __attribute__((__sfr__));
__extension__ typedef struct tagDAC2CONBITS {
  union {
    struct {
      uint16_t DACREF:2;
      uint16_t DACTSEL:5;
      uint16_t :1;
      uint16_t DACTRIG:1;
      uint16_t :2;
      uint16_t DACFM:1;
      uint16_t DACSLP:1;
      uint16_t DACSIDL:1;
      uint16_t :1;
      uint16_t DACEN:1;
    };
    struct {
      uint16_t REFSEL0:1;
      uint16_t REFSEL1:1;
      uint16_t DACTSEL0:1;
      uint16_t DACTSEL1:1;
      uint16_t DACTSEL2:1;
      uint16_t DACTSEL3:1;
      uint16_t DACTSEL4:1;
    };
  };
} DAC2CONBITS;
extern volatile DAC2CONBITS DAC2CONbits __attribute__((__sfr__));

#define DAC2DAT DAC2DAT
extern volatile uint16_t DAC2DAT __attribute__((__sfr__));
#define U1OTGIR U1OTGIR
extern volatile uint16_t U1OTGIR __attribute__((__sfr__));
typedef struct tagU1OTGIRBITS {
  uint16_t VBUSVDIF:1;
  uint16_t :1;
  uint16_t SESENDIF:1;
  uint16_t SESVDIF:1;
  uint16_t ACTVIF:1;
  uint16_t LSTATEIF:1;
  uint16_t T1MSECIF:1;
  uint16_t IDIF:1;
} U1OTGIRBITS;
extern volatile U1OTGIRBITS U1OTGIRbits __attribute__((__sfr__));

#define U1OTGIE U1OTGIE
extern volatile uint16_t U1OTGIE __attribute__((__sfr__));
typedef struct tagU1OTGIEBITS {
  uint16_t VBUSVDIE:1;
  uint16_t :1;
  uint16_t SESENDIE:1;
  uint16_t SESVDIE:1;
  uint16_t ACTVIE:1;
  uint16_t LSTATEIE:1;
  uint16_t T1MSECIE:1;
  uint16_t IDIE:1;
} U1OTGIEBITS;
extern volatile U1OTGIEBITS U1OTGIEbits __attribute__((__sfr__));

#define U1OTGSTAT U1OTGSTAT
extern volatile uint16_t U1OTGSTAT __attribute__((__sfr__));
typedef struct tagU1OTGSTATBITS {
  uint16_t VBUSVD:1;
  uint16_t :1;
  uint16_t SESEND:1;
  uint16_t SESVD:1;
  uint16_t :1;
  uint16_t LSTATE:1;
  uint16_t :1;
  uint16_t ID:1;
} U1OTGSTATBITS;
