MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
extern volatile U1OTGSTATBITS U1OTGSTATbits __attribute__((__sfr__));

#define U1OTGCON U1OTGCON
extern volatile uint16_t U1OTGCON __attribute__((__sfr__));
typedef struct tagU1OTGCONBITS {
  uint16_t VBUSDIS:1;
  uint16_t VBUSCHG:1;
  uint16_t OTGEN:1;
  uint16_t :1;
  uint16_t DMPULDWN:1;
  uint16_t DPPULDWN:1;
  uint16_t DMPULUP:1;
  uint16_t DPPULUP:1;
} U1OTGCONBITS;
extern volatile U1OTGCONBITS U1OTGCONbits __attribute__((__sfr__));

#define U1PWRC U1PWRC
extern volatile uint16_t U1PWRC __attribute__((__sfr__));
__extension__ typedef struct tagU1PWRCBITS {
  union {
    struct {
      uint16_t USBPWR:1;
      uint16_t USUSPND:1;
      uint16_t :2;
      uint16_t USLPGRD:1;
      uint16_t :2;
      uint16_t UACTPND:1;
    };
    struct {
      uint16_t :1;
      uint16_t USUSPEND:1;
    };
  };
} U1PWRCBITS;
extern volatile U1PWRCBITS U1PWRCbits __attribute__((__sfr__));

#define U1IR U1IR
extern volatile uint16_t U1IR __attribute__((__sfr__));
__extension__ typedef struct tagU1IRBITS {
  union {
    struct {
      uint16_t URSTIF:1;
      uint16_t UERRIF:1;
      uint16_t SOFIF:1;
      uint16_t TRNIF:1;
      uint16_t IDLEIF:1;
      uint16_t RESUMEIF:1;
      uint16_t ATTACHIF:1;
      uint16_t STALLIF:1;
    };
    struct {
      uint16_t DETACHIF:1;
    };
  };
} U1IRBITS;
extern volatile U1IRBITS U1IRbits __attribute__((__sfr__));

#define U1IE U1IE
extern volatile uint16_t U1IE __attribute__((__sfr__));
__extension__ typedef struct tagU1IEBITS {
  union {
    struct {
      uint16_t URSTIE:1;
      uint16_t UERRIE:1;
      uint16_t SOFIE:1;
      uint16_t TRNIE:1;
      uint16_t IDLEIE:1;
      uint16_t RESUMEIE:1;
      uint16_t ATTACHIE:1;
      uint16_t STALLIE:1;
    };
    struct {
      uint16_t DETACHIE:1;
    };
  };
} U1IEBITS;
extern volatile U1IEBITS U1IEbits __attribute__((__sfr__));

#define U1EIR U1EIR
extern volatile uint16_t U1EIR __attribute__((__sfr__));
__extension__ typedef struct tagU1EIRBITS {
  union {
    struct {
      uint16_t PIDEF:1;
      uint16_t CRC5EF:1;
      uint16_t CRC16EF:1;
      uint16_t DFN8EF:1;
      uint16_t BTOEF:1;
      uint16_t DMAEF:1;
      uint16_t :1;
      uint16_t BTSEF:1;
    };
    struct {
      uint16_t :1;
      uint16_t EOFEF:1;
    };
  };
} U1EIRBITS;
extern volatile U1EIRBITS U1EIRbits __attribute__((__sfr__));

#define U1EIE U1EIE
extern volatile uint16_t U1EIE __attribute__((__sfr__));
__extension__ typedef struct tagU1EIEBITS {
  union {
    struct {
      uint16_t PIDEE:1;
      uint16_t CRC5EE:1;
      uint16_t CRC16EE:1;
      uint16_t DFN8EE:1;
      uint16_t BTOEE:1;
      uint16_t DMAEE:1;
      uint16_t :1;
      uint16_t BTSEE:1;
    };
    struct {
      uint16_t :1;
      uint16_t EOFEE:1;
    };
  };
} U1EIEBITS;
extern volatile U1EIEBITS U1EIEbits __attribute__((__sfr__));

#define U1STAT U1STAT
extern volatile uint16_t U1STAT __attribute__((__sfr__));
__extension__ typedef struct tagU1STATBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t PPBI:1;
      uint16_t DIR:1;
      uint16_t ENDPT:4;
    };
    struct {
      uint16_t :4;
      uint16_t ENDPT0:1;
      uint16_t ENDPT1:1;
      uint16_t ENDPT2:1;
      uint16_t ENDPT3:1;
    };
  };
} U1STATBITS;
extern volatile U1STATBITS U1STATbits __attribute__((__sfr__));

#define U1CON U1CON
extern volatile uint16_t U1CON __attribute__((__sfr__));
__extension__ typedef struct tagU1CONBITS {
  union {
    struct {
      uint16_t USBEN:1;
      uint16_t PPBRST:1;
      uint16_t RESUME:1;
      uint16_t HOSTEN:1;
      uint16_t USBRST:1;
      uint16_t PKTDIS:1;
      uint16_t SE0:1;
      uint16_t JSTATE:1;
    };
    struct {
      uint16_t SOFEN:1;
      uint16_t :3;
      uint16_t RESET:1;
      uint16_t TOKBUSY:1;
    };
  };
} U1CONBITS;
extern volatile U1CONBITS U1CONbits __attribute__((__sfr__));

#define U1ADDR U1ADDR
extern volatile uint16_t U1ADDR __attribute__((__sfr__));
__extension__ typedef struct tagU1ADDRBITS {
  union {
    struct {
      uint16_t DEVADDR:7;
      uint16_t LOWSPDEN:1;
    };
    struct {
      uint16_t DEVADDR0:1;
      uint16_t DEVADDR1:1;
      uint16_t DEVADDR2:1;
      uint16_t DEVADDR3:1;
      uint16_t DEVADDR4:1;
      uint16_t DEVADDR5:1;
      uint16_t DEVADDR6:1;
      uint16_t LSPDEN:1;
    };
  };
} U1ADDRBITS;
extern volatile U1ADDRBITS U1ADDRbits __attribute__((__sfr__));

#define U1BDTP1 U1BDTP1
extern volatile uint16_t U1BDTP1 __attribute__((__sfr__));
__extension__ typedef struct tagU1BDTP1BITS {
  union {
    struct {
      uint16_t :1;
      uint16_t BDTPTRL:7;
    };
    struct {
      uint16_t :1;
      uint16_t BDTPTRL0:1;
      uint16_t BDTPTRL1:1;
      uint16_t BDTPTRL2:1;
      uint16_t BDTPTRL3:1;
      uint16_t BDTPTRL4:1;
      uint16_t BDTPTRL5:1;
      uint16_t BDTPTRL6:1;
    };
  };
} U1BDTP1BITS;
extern volatile U1BDTP1BITS U1BDTP1bits __attribute__((__sfr__));

#define U1FRML U1FRML
extern volatile uint16_t U1FRML __attribute__((__sfr__));
typedef struct tagU1FRMLBITS {
  uint16_t FRM0:1;
  uint16_t FRM1:1;
  uint16_t FRM2:1;
  uint16_t FRM3:1;
  uint16_t FRM4:1;
  uint16_t FRM5:1;
  uint16_t FRM6:1;
  uint16_t FRM7:1;
} U1FRMLBITS;
extern volatile U1FRMLBITS U1FRMLbits __attribute__((__sfr__));

#define U1FRMH U1FRMH
extern volatile uint16_t U1FRMH __attribute__((__sfr__));
typedef struct tagU1FRMHBITS {
  uint16_t FRM8:1;
  uint16_t FRM9:1;
  uint16_t FRM10:1;
} U1FRMHBITS;
extern volatile U1FRMHBITS U1FRMHbits __attribute__((__sfr__));

#define U1TOK U1TOK
extern volatile uint16_t U1TOK __attribute__((__sfr__));
__extension__ typedef struct tagU1TOKBITS {
  union {
    struct {
      uint16_t EP:4;
      uint16_t PID:4;
    };
    struct {
      uint16_t EP0:1;
      uint16_t EP1:1;
      uint16_t EP2:1;
      uint16_t EP3:1;
      uint16_t PID0:1;
      uint16_t PID1:1;
      uint16_t PID2:1;
      uint16_t PID3:1;
    };
  };
} U1TOKBITS;
extern volatile U1TOKBITS U1TOKbits __attribute__((__sfr__));

#define U1SOF U1SOF
extern volatile uint16_t U1SOF __attribute__((__sfr__));
__extension__ typedef struct tagU1SOFBITS {
  union {
    struct {
      uint16_t CNT:8;
    };
    struct {
      uint16_t CNT0:1;
      uint16_t CNT1:1;
      uint16_t CNT2:1;
      uint16_t CNT3:1;
      uint16_t CNT4:1;
      uint16_t CNT5:1;
      uint16_t CNT6:1;
      uint16_t CNT7:1;
    };
  };
} U1SOFBITS;
