MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
#define ADL0CONH ADL0CONH
extern volatile uint16_t ADL0CONH __attribute__((__sfr__));
__extension__ typedef struct tagADL0CONHBITS {
  union {
    struct {
      uint16_t SAMC:5;
      uint16_t MULCHEN:1;
      uint16_t PINTRIS:1;
      uint16_t CTMEN:1;
      uint16_t CM:3;
      uint16_t WM:2;
      uint16_t SLINT:2;
      uint16_t ASEN:1;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t :3;
      uint16_t CM0:1;
      uint16_t CM1:1;
      uint16_t CM2:1;
      uint16_t WM0:1;
      uint16_t WM1:1;
      uint16_t SLINT0:1;
      uint16_t SLINT1:1;
    };
  };
} ADL0CONHBITS;
extern volatile ADL0CONHBITS ADL0CONHbits __attribute__((__sfr__));

#define ADL0PTR ADL0PTR
extern volatile uint16_t ADL0PTR __attribute__((__sfr__));
__extension__ typedef struct tagADL0PTRBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t ADNEXT:7;
    };
    struct {
      uint16_t :8;
      uint16_t ADNEXT0:1;
      uint16_t ADNEXT1:1;
      uint16_t ADNEXT2:1;
      uint16_t ADNEXT3:1;
      uint16_t ADNEXT4:1;
      uint16_t ADNEXT5:1;
      uint16_t ADNEXT6:1;
    };
  };
} ADL0PTRBITS;
extern volatile ADL0PTRBITS ADL0PTRbits __attribute__((__sfr__));

#define ADL0STAT ADL0STAT
extern volatile uint16_t ADL0STAT __attribute__((__sfr__));
typedef struct tagADL0STATBITS {
  uint16_t :5;
  uint16_t ADLIF:1;
  uint16_t :1;
  uint16_t ADTDLY:1;
  uint16_t :6;
  uint16_t LBUSY:1;
  uint16_t ADTACT:1;
} ADL0STATBITS;
extern volatile ADL0STATBITS ADL0STATbits __attribute__((__sfr__));

#define ADTH0L ADTH0L
extern volatile uint16_t ADTH0L __attribute__((__sfr__));
typedef struct tagADTH0LBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH0LBITS;
extern volatile ADTH0LBITS ADTH0Lbits __attribute__((__sfr__));

#define ADTH0H ADTH0H
extern volatile uint16_t ADTH0H __attribute__((__sfr__));
typedef struct tagADTH0HBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH0HBITS;
extern volatile ADTH0HBITS ADTH0Hbits __attribute__((__sfr__));

#define ADL0MSEL ADL0MSEL
extern volatile uint64_t ADL0MSEL __attribute__((__sfr__));
#define ADL0MSEL0 ADL0MSEL0
extern volatile uint16_t ADL0MSEL0 __attribute__((__sfr__));
typedef struct tagADL0MSEL0BITS {
  uint16_t :15;
  uint16_t MSEL15:1;
} ADL0MSEL0BITS;
extern volatile ADL0MSEL0BITS ADL0MSEL0bits __attribute__((__sfr__));

#define ADL0MSEL1 ADL0MSEL1
extern volatile uint16_t ADL0MSEL1 __attribute__((__sfr__));
typedef struct tagADL0MSEL1BITS {
  uint16_t MSEL16:1;
  uint16_t MSEL17:1;
  uint16_t MSEL18:1;
  uint16_t MSEL19:1;
  uint16_t MSEL20:1;
  uint16_t MSEL21:1;
  uint16_t MSEL22:1;
  uint16_t MSEL23:1;
  uint16_t MSEL24:1;
  uint16_t MSEL25:1;
  uint16_t MSEL26:1;
  uint16_t MSEL27:1;
  uint16_t MSEL28:1;
  uint16_t MSEL29:1;
  uint16_t MSEL30:1;
  uint16_t MSEL31:1;
} ADL0MSEL1BITS;
extern volatile ADL0MSEL1BITS ADL0MSEL1bits __attribute__((__sfr__));

#define ADL0MSEL2 ADL0MSEL2
extern volatile uint16_t ADL0MSEL2 __attribute__((__sfr__));
typedef struct tagADL0MSEL2BITS {
  uint16_t MSEL32:1;
  uint16_t MSEL33:1;
  uint16_t MSEL34:1;
  uint16_t MSEL35:1;
  uint16_t MSEL36:1;
  uint16_t MSEL37:1;
  uint16_t MSEL38:1;
  uint16_t MSEL39:1;
  uint16_t MSEL40:1;
  uint16_t MSEL41:1;
  uint16_t MSEL42:1;
  uint16_t MSEL43:1;
  uint16_t MSEL44:1;
  uint16_t MSEL45:1;
  uint16_t MSEL46:1;
  uint16_t MSEL47:1;
} ADL0MSEL2BITS;
extern volatile ADL0MSEL2BITS ADL0MSEL2bits __attribute__((__sfr__));

#define ADL0MSEL3 ADL0MSEL3
extern volatile uint16_t ADL0MSEL3 __attribute__((__sfr__));
typedef struct tagADL0MSEL3BITS {
  uint16_t MSEL48:1;
  uint16_t MSEL49:1;
} ADL0MSEL3BITS;
extern volatile ADL0MSEL3BITS ADL0MSEL3bits __attribute__((__sfr__));

#define ADL1CON ADL1CON
extern volatile uint32_t ADL1CON __attribute__((__sfr__));
#define ADL1CONL ADL1CONL
extern volatile uint16_t ADL1CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL1CONLBITS {
  union {
    struct {
      uint16_t SLSIZE:6;
      uint16_t :1;
      uint16_t THSRC:1;
      uint16_t SLTSRC:5;
      uint16_t SLENCLR:1;
      uint16_t SAMP:1;
      uint16_t SLEN:1;
    };
    struct {
      uint16_t SLSIZE0:1;
      uint16_t SLSIZE1:1;
      uint16_t SLSIZE2:1;
      uint16_t SLSIZE3:1;
      uint16_t SLSIZE4:1;
      uint16_t SLSIZE5:1;
      uint16_t :2;
      uint16_t SLTSRC0:1;
      uint16_t SLTSRC1:1;
      uint16_t SLTSRC2:1;
      uint16_t SLTSRC3:1;
      uint16_t SLTSRC4:1;
    };
  };
} ADL1CONLBITS;
extern volatile ADL1CONLBITS ADL1CONLbits __attribute__((__sfr__));

#define ADL1CONH ADL1CONH
extern volatile uint16_t ADL1CONH __attribute__((__sfr__));
__extension__ typedef struct tagADL1CONHBITS {
  union {
    struct {
      uint16_t SAMC:5;
      uint16_t MULCHEN:1;
      uint16_t PINTRIS:1;
      uint16_t CTMEN:1;
      uint16_t CM:3;
      uint16_t WM:2;
      uint16_t SLINT:2;
      uint16_t ASEN:1;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t :3;
      uint16_t CM0:1;
      uint16_t CM1:1;
      uint16_t CM2:1;
      uint16_t WM0:1;
      uint16_t WM1:1;
      uint16_t SLINT0:1;
      uint16_t SLINT1:1;
    };
  };
} ADL1CONHBITS;
extern volatile ADL1CONHBITS ADL1CONHbits __attribute__((__sfr__));

#define ADL1PTR ADL1PTR
extern volatile uint16_t ADL1PTR __attribute__((__sfr__));
__extension__ typedef struct tagADL1PTRBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t ADNEXT:7;
    };
    struct {
      uint16_t :8;
      uint16_t ADNEXT0:1;
      uint16_t ADNEXT1:1;
      uint16_t ADNEXT2:1;
      uint16_t ADNEXT3:1;
      uint16_t ADNEXT4:1;
      uint16_t ADNEXT5:1;
      uint16_t ADNEXT6:1;
    };
  };
} ADL1PTRBITS;
