MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
extern volatile ADL1PTRBITS ADL1PTRbits __attribute__((__sfr__));

#define ADL1STAT ADL1STAT
extern volatile uint16_t ADL1STAT __attribute__((__sfr__));
typedef struct tagADL1STATBITS {
  uint16_t :5;
  uint16_t ADLIF:1;
  uint16_t :1;
  uint16_t ADTDLY:1;
  uint16_t :6;
  uint16_t LBUSY:1;
  uint16_t ADTACT:1;
} ADL1STATBITS;
extern volatile ADL1STATBITS ADL1STATbits __attribute__((__sfr__));

#define ADTH1L ADTH1L
extern volatile uint16_t ADTH1L __attribute__((__sfr__));
typedef struct tagADTH1LBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH1LBITS;
extern volatile ADTH1LBITS ADTH1Lbits __attribute__((__sfr__));

#define ADTH1H ADTH1H
extern volatile uint16_t ADTH1H __attribute__((__sfr__));
typedef struct tagADTH1HBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH1HBITS;
extern volatile ADTH1HBITS ADTH1Hbits __attribute__((__sfr__));

#define ADL1MSEL ADL1MSEL
extern volatile uint64_t ADL1MSEL __attribute__((__sfr__));
#define ADL1MSEL0 ADL1MSEL0
extern volatile uint16_t ADL1MSEL0 __attribute__((__sfr__));
typedef struct tagADL1MSEL0BITS {
  uint16_t :15;
  uint16_t MSEL15:1;
} ADL1MSEL0BITS;
extern volatile ADL1MSEL0BITS ADL1MSEL0bits __attribute__((__sfr__));

#define ADL1MSEL1 ADL1MSEL1
extern volatile uint16_t ADL1MSEL1 __attribute__((__sfr__));
typedef struct tagADL1MSEL1BITS {
  uint16_t MSEL16:1;
  uint16_t MSEL17:1;
  uint16_t MSEL18:1;
  uint16_t MSEL19:1;
  uint16_t MSEL20:1;
  uint16_t MSEL21:1;
  uint16_t MSEL22:1;
  uint16_t MSEL23:1;
  uint16_t MSEL24:1;
  uint16_t MSEL25:1;
  uint16_t MSEL26:1;
  uint16_t MSEL27:1;
  uint16_t MSEL28:1;
  uint16_t MSEL29:1;
  uint16_t MSEL30:1;
  uint16_t MSEL31:1;
} ADL1MSEL1BITS;
extern volatile ADL1MSEL1BITS ADL1MSEL1bits __attribute__((__sfr__));

#define ADL1MSEL2 ADL1MSEL2
extern volatile uint16_t ADL1MSEL2 __attribute__((__sfr__));
typedef struct tagADL1MSEL2BITS {
  uint16_t MSEL32:1;
  uint16_t MSEL33:1;
  uint16_t MSEL34:1;
  uint16_t MSEL35:1;
  uint16_t MSEL36:1;
  uint16_t MSEL37:1;
  uint16_t MSEL38:1;
  uint16_t MSEL39:1;
  uint16_t MSEL40:1;
  uint16_t MSEL41:1;
  uint16_t MSEL42:1;
  uint16_t MSEL43:1;
  uint16_t MSEL44:1;
  uint16_t MSEL45:1;
  uint16_t MSEL46:1;
  uint16_t MSEL47:1;
} ADL1MSEL2BITS;
extern volatile ADL1MSEL2BITS ADL1MSEL2bits __attribute__((__sfr__));

#define ADL1MSEL3 ADL1MSEL3
extern volatile uint16_t ADL1MSEL3 __attribute__((__sfr__));
typedef struct tagADL1MSEL3BITS {
  uint16_t MSEL48:1;
  uint16_t MSEL49:1;
} ADL1MSEL3BITS;
extern volatile ADL1MSEL3BITS ADL1MSEL3bits __attribute__((__sfr__));

#define ADL2CON ADL2CON
extern volatile uint32_t ADL2CON __attribute__((__sfr__));
#define ADL2CONL ADL2CONL
extern volatile uint16_t ADL2CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL2CONLBITS {
  union {
    struct {
      uint16_t SLSIZE:6;
      uint16_t :1;
      uint16_t THSRC:1;
      uint16_t SLTSRC:5;
      uint16_t SLENCLR:1;
      uint16_t SAMP:1;
      uint16_t SLEN:1;
    };
    struct {
      uint16_t SLSIZE0:1;
      uint16_t SLSIZE1:1;
      uint16_t SLSIZE2:1;
      uint16_t SLSIZE3:1;
      uint16_t SLSIZE4:1;
      uint16_t SLSIZE5:1;
      uint16_t :2;
      uint16_t SLTSRC0:1;
      uint16_t SLTSRC1:1;
      uint16_t SLTSRC2:1;
      uint16_t SLTSRC3:1;
      uint16_t SLTSRC4:1;
    };
  };
} ADL2CONLBITS;
extern volatile ADL2CONLBITS ADL2CONLbits __attribute__((__sfr__));

#define ADL2CONH ADL2CONH
extern volatile uint16_t ADL2CONH __attribute__((__sfr__));
__extension__ typedef struct tagADL2CONHBITS {
  union {
    struct {
      uint16_t SAMC:5;
      uint16_t MULCHEN:1;
      uint16_t PINTRIS:1;
      uint16_t CTMEN:1;
      uint16_t CM:3;
      uint16_t WM:2;
      uint16_t SLINT:2;
      uint16_t ASEN:1;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t :3;
      uint16_t CM0:1;
      uint16_t CM1:1;
      uint16_t CM2:1;
      uint16_t WM0:1;
      uint16_t WM1:1;
      uint16_t SLINT0:1;
      uint16_t SLINT1:1;
    };
  };
} ADL2CONHBITS;
extern volatile ADL2CONHBITS ADL2CONHbits __attribute__((__sfr__));

#define ADL2PTR ADL2PTR
extern volatile uint16_t ADL2PTR __attribute__((__sfr__));
__extension__ typedef struct tagADL2PTRBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t ADNEXT:7;
    };
    struct {
      uint16_t :8;
      uint16_t ADNEXT0:1;
      uint16_t ADNEXT1:1;
      uint16_t ADNEXT2:1;
      uint16_t ADNEXT3:1;
      uint16_t ADNEXT4:1;
      uint16_t ADNEXT5:1;
      uint16_t ADNEXT6:1;
    };
  };
} ADL2PTRBITS;
extern volatile ADL2PTRBITS ADL2PTRbits __attribute__((__sfr__));

#define ADL2STAT ADL2STAT
extern volatile uint16_t ADL2STAT __attribute__((__sfr__));
typedef struct tagADL2STATBITS {
  uint16_t :5;
  uint16_t ADLIF:1;
  uint16_t :1;
  uint16_t ADTDLY:1;
  uint16_t :6;
  uint16_t LBUSY:1;
  uint16_t ADTACT:1;
} ADL2STATBITS;
extern volatile ADL2STATBITS ADL2STATbits __attribute__((__sfr__));

#define ADTH2L ADTH2L
extern volatile uint16_t ADTH2L __attribute__((__sfr__));
typedef struct tagADTH2LBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH2LBITS;
extern volatile ADTH2LBITS ADTH2Lbits __attribute__((__sfr__));

#define ADTH2H ADTH2H
extern volatile uint16_t ADTH2H __attribute__((__sfr__));
typedef struct tagADTH2HBITS {
  uint16_t TH0:1;
  uint16_t TH1:1;
  uint16_t TH2:1;
  uint16_t TH3:1;
  uint16_t TH4:1;
  uint16_t TH5:1;
  uint16_t TH6:1;
  uint16_t TH7:1;
  uint16_t TH8:1;
  uint16_t TH9:1;
  uint16_t TH10:1;
  uint16_t TH11:1;
  uint16_t TH12:1;
  uint16_t TH13:1;
  uint16_t TH14:1;
  uint16_t TH15:1;
} ADTH2HBITS;
