MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
extern volatile ADTH2HBITS ADTH2Hbits __attribute__((__sfr__));

#define ADL2MSEL ADL2MSEL
extern volatile uint64_t ADL2MSEL __attribute__((__sfr__));
#define ADL2MSEL0 ADL2MSEL0
extern volatile uint16_t ADL2MSEL0 __attribute__((__sfr__));
typedef struct tagADL2MSEL0BITS {
  uint16_t :15;
  uint16_t MSEL15:1;
} ADL2MSEL0BITS;
extern volatile ADL2MSEL0BITS ADL2MSEL0bits __attribute__((__sfr__));

#define ADL2MSEL1 ADL2MSEL1
extern volatile uint16_t ADL2MSEL1 __attribute__((__sfr__));
typedef struct tagADL2MSEL1BITS {
  uint16_t MSEL16:1;
  uint16_t MSEL17:1;
  uint16_t MSEL18:1;
  uint16_t MSEL19:1;
  uint16_t MSEL20:1;
  uint16_t MSEL21:1;
  uint16_t MSEL22:1;
  uint16_t MSEL23:1;
  uint16_t MSEL24:1;
  uint16_t MSEL25:1;
  uint16_t MSEL26:1;
  uint16_t MSEL27:1;
  uint16_t MSEL28:1;
  uint16_t MSEL29:1;
  uint16_t MSEL30:1;
  uint16_t MSEL31:1;
} ADL2MSEL1BITS;
extern volatile ADL2MSEL1BITS ADL2MSEL1bits __attribute__((__sfr__));

#define ADL2MSEL2 ADL2MSEL2
extern volatile uint16_t ADL2MSEL2 __attribute__((__sfr__));
typedef struct tagADL2MSEL2BITS {
  uint16_t MSEL32:1;
  uint16_t MSEL33:1;
  uint16_t MSEL34:1;
  uint16_t MSEL35:1;
  uint16_t MSEL36:1;
  uint16_t MSEL37:1;
  uint16_t MSEL38:1;
  uint16_t MSEL39:1;
  uint16_t MSEL40:1;
  uint16_t MSEL41:1;
  uint16_t MSEL42:1;
  uint16_t MSEL43:1;
  uint16_t MSEL44:1;
  uint16_t MSEL45:1;
  uint16_t MSEL46:1;
  uint16_t MSEL47:1;
} ADL2MSEL2BITS;
extern volatile ADL2MSEL2BITS ADL2MSEL2bits __attribute__((__sfr__));

#define ADL2MSEL3 ADL2MSEL3
extern volatile uint16_t ADL2MSEL3 __attribute__((__sfr__));
typedef struct tagADL2MSEL3BITS {
  uint16_t MSEL48:1;
  uint16_t MSEL49:1;
} ADL2MSEL3BITS;
extern volatile ADL2MSEL3BITS ADL2MSEL3bits __attribute__((__sfr__));

#define LCDREG LCDREG
extern volatile uint16_t LCDREG __attribute__((__sfr__));
__extension__ typedef struct tagLCDREGBITS {
  union {
    struct {
      uint16_t CKSEL:2;
      uint16_t MODE13:1;
      uint16_t BIAS:3;
      uint16_t :9;
      uint16_t CPEN:1;
    };
    struct {
      uint16_t CKSEL0:1;
      uint16_t CKSEL1:1;
      uint16_t :1;
      uint16_t BIAS0:1;
      uint16_t BIAS1:1;
      uint16_t BIAS2:1;
    };
  };
} LCDREGBITS;
extern volatile LCDREGBITS LCDREGbits __attribute__((__sfr__));

#define LCDREF LCDREF
extern volatile uint16_t LCDREF __attribute__((__sfr__));
__extension__ typedef struct tagLCDREFBITS {
  union {
    struct {
      uint16_t LRLAT:3;
      uint16_t :1;
      uint16_t LRLBP:2;
      uint16_t LRLAP:2;
      uint16_t VLCD1PE:1;
      uint16_t VLCD2PE:1;
      uint16_t VLCD3PE:1;
      uint16_t LCDCST:3;
      uint16_t :1;
      uint16_t LCDIRE:1;
    };
    struct {
      uint16_t LRLAT0:1;
      uint16_t LRLAT1:1;
      uint16_t LRLAT2:1;
      uint16_t :1;
      uint16_t LRLBP0:1;
      uint16_t LRLBP1:1;
      uint16_t LRLAP0:1;
      uint16_t LRLAP1:1;
      uint16_t :3;
      uint16_t LCDCST0:1;
      uint16_t LCDCST1:1;
      uint16_t LCDCST2:1;
    };
  };
} LCDREFBITS;
extern volatile LCDREFBITS LCDREFbits __attribute__((__sfr__));

#define LCDCON LCDCON
extern volatile uint16_t LCDCON __attribute__((__sfr__));
__extension__ typedef struct tagLCDCONBITS {
  union {
    struct {
      uint16_t LMUX:3;
      uint16_t CS:2;
      uint16_t WERR:1;
      uint16_t SLPEN:1;
      uint16_t :6;
      uint16_t LCDSIDL:1;
      uint16_t :1;
      uint16_t LCDEN:1;
    };
    struct {
      uint16_t LMUX0:1;
      uint16_t LMUX1:1;
      uint16_t LMUX2:1;
      uint16_t CS0:1;
      uint16_t CS1:1;
    };
  };
} LCDCONBITS;
extern volatile LCDCONBITS LCDCONbits __attribute__((__sfr__));

#define LCDPS LCDPS
extern volatile uint16_t LCDPS __attribute__((__sfr__));
__extension__ typedef struct tagLCDPSBITS {
  union {
    struct {
      uint16_t LP:4;
      uint16_t WA:1;
      uint16_t LCDA:1;
      uint16_t BIASMD:1;
      uint16_t WFT:1;
    };
    struct {
      uint16_t LP0:1;
      uint16_t LP1:1;
      uint16_t LP2:1;
      uint16_t LP3:1;
    };
  };
} LCDPSBITS;
extern volatile LCDPSBITS LCDPSbits __attribute__((__sfr__));

#define LCDSE0 LCDSE0
extern volatile uint16_t LCDSE0 __attribute__((__sfr__));
typedef struct tagLCDSE0BITS {
  uint16_t SE00:1;
  uint16_t SE01:1;
  uint16_t SE02:1;
  uint16_t SE03:1;
  uint16_t SE04:1;
  uint16_t SE05:1;
  uint16_t SE06:1;
  uint16_t SE07:1;
  uint16_t SE08:1;
  uint16_t SE09:1;
  uint16_t SE10:1;
  uint16_t SE11:1;
  uint16_t SE12:1;
  uint16_t SE13:1;
  uint16_t SE14:1;
  uint16_t SE15:1;
} LCDSE0BITS;
extern volatile LCDSE0BITS LCDSE0bits __attribute__((__sfr__));

#define LCDSE1 LCDSE1
extern volatile uint16_t LCDSE1 __attribute__((__sfr__));
typedef struct tagLCDSE1BITS {
  uint16_t SE16:1;
  uint16_t SE17:1;
  uint16_t SE18:1;
  uint16_t SE19:1;
  uint16_t SE20:1;
  uint16_t SE21:1;
  uint16_t SE22:1;
  uint16_t SE23:1;
  uint16_t SE24:1;
  uint16_t SE25:1;
  uint16_t SE26:1;
  uint16_t SE27:1;
  uint16_t SE28:1;
  uint16_t SE29:1;
  uint16_t SE30:1;
  uint16_t SE31:1;
} LCDSE1BITS;
extern volatile LCDSE1BITS LCDSE1bits __attribute__((__sfr__));

#define LCDSE2 LCDSE2
extern volatile uint16_t LCDSE2 __attribute__((__sfr__));
typedef struct tagLCDSE2BITS {
  uint16_t SE32:1;
  uint16_t SE33:1;
  uint16_t SE34:1;
  uint16_t SE35:1;
  uint16_t SE36:1;
  uint16_t SE37:1;
  uint16_t SE38:1;
  uint16_t SE39:1;
  uint16_t SE40:1;
  uint16_t SE41:1;
  uint16_t SE42:1;
  uint16_t SE43:1;
  uint16_t SE44:1;
  uint16_t SE45:1;
  uint16_t SE46:1;
  uint16_t SE47:1;
} LCDSE2BITS;
extern volatile LCDSE2BITS LCDSE2bits __attribute__((__sfr__));

#define LCDSE3 LCDSE3
extern volatile uint16_t LCDSE3 __attribute__((__sfr__));
typedef struct tagLCDSE3BITS {
  uint16_t SE48:1;
  uint16_t SE49:1;
  uint16_t SE50:1;
  uint16_t SE51:1;
  uint16_t SE52:1;
  uint16_t SE53:1;
  uint16_t SE54:1;
  uint16_t SE55:1;
  uint16_t SE56:1;
  uint16_t SE57:1;
  uint16_t SE58:1;
  uint16_t SE59:1;
  uint16_t SE60:1;
  uint16_t SE61:1;
  uint16_t SE62:1;
  uint16_t SE63:1;
} LCDSE3BITS;
extern volatile LCDSE3BITS LCDSE3bits __attribute__((__sfr__));

#define LCDDATA0 LCDDATA0
extern volatile uint16_t LCDDATA0 __attribute__((__sfr__));
typedef struct tagLCDDATA0BITS {
  uint16_t S00C0:1;
  uint16_t S01C0:1;
  uint16_t S02C0:1;
  uint16_t S03C0:1;
  uint16_t S04C0:1;
  uint16_t S05C0:1;
  uint16_t S06C0:1;
  uint16_t S07C0:1;
  uint16_t S08C0:1;
  uint16_t S09C0:1;
  uint16_t S10C0:1;
  uint16_t S11C0:1;
  uint16_t S12C0:1;
  uint16_t S13C0:1;
  uint16_t S14C0:1;
  uint16_t S15C0:1;
} LCDDATA0BITS;
extern volatile LCDDATA0BITS LCDDATA0bits __attribute__((__sfr__));

#define LCDDATA1 LCDDATA1
extern volatile uint16_t LCDDATA1 __attribute__((__sfr__));
typedef struct tagLCDDATA1BITS {
  uint16_t S16C0:1;
  uint16_t S17C0:1;
  uint16_t S18C0:1;
  uint16_t S19C0:1;
  uint16_t S20C0:1;
  uint16_t S21C0:1;
  uint16_t S22C0:1;
  uint16_t S23C0:1;
  uint16_t S24C0:1;
  uint16_t S25C0:1;
  uint16_t S26C0:1;
  uint16_t S27C0:1;
  uint16_t S28C0:1;
  uint16_t S29C0:1;
  uint16_t S30C0:1;
  uint16_t S31C0:1;
} LCDDATA1BITS;
extern volatile LCDDATA1BITS LCDDATA1bits __attribute__((__sfr__));

#define LCDDATA2 LCDDATA2
extern volatile uint16_t LCDDATA2 __attribute__((__sfr__));
typedef struct tagLCDDATA2BITS {
  uint16_t S32C0:1;
  uint16_t S33C0:1;
  uint16_t S34C0:1;
  uint16_t S35C0:1;
  uint16_t S36C0:1;
  uint16_t S37C0:1;
  uint16_t S38C0:1;
  uint16_t S39C0:1;
  uint16_t S40C0:1;
  uint16_t S41C0:1;
  uint16_t S42C0:1;
  uint16_t S43C0:1;
  uint16_t S44C0:1;
  uint16_t S45C0:1;
  uint16_t S46C0:1;
  uint16_t S47C0:1;
} LCDDATA2BITS;
extern volatile LCDDATA2BITS LCDDATA2bits __attribute__((__sfr__));

#define LCDDATA3 LCDDATA3
extern volatile uint16_t LCDDATA3 __attribute__((__sfr__));
typedef struct tagLCDDATA3BITS {
  uint16_t S48C0:1;
  uint16_t S49C0:1;
  uint16_t S50C0:1;
  uint16_t S51C0:1;
  uint16_t S52C0:1;
  uint16_t S53C0:1;
  uint16_t S54C0:1;
  uint16_t S55C0:1;
  uint16_t S56C0:1;
  uint16_t S57C0:1;
  uint16_t S58C0:1;
  uint16_t S59C0:1;
  uint16_t S60C0:1;
  uint16_t S61C0:1;
  uint16_t S62C0:1;
  uint16_t S63C0:1;
} LCDDATA3BITS;
