MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
#define _CNEN1_CN13IE_POSITION                   0x0000000D
#define _CNEN1_CN13IE_MASK                       0x00002000
#define _CNEN1_CN13IE_LENGTH                     0x00000001

#define _CNEN1_CN14IE_POSITION                   0x0000000E
#define _CNEN1_CN14IE_MASK                       0x00004000
#define _CNEN1_CN14IE_LENGTH                     0x00000001

#define _CNEN1_CN15IE_POSITION                   0x0000000F
#define _CNEN1_CN15IE_MASK                       0x00008000
#define _CNEN1_CN15IE_LENGTH                     0x00000001

#define _CNEN2_CN16IE_POSITION                   0x00000000
#define _CNEN2_CN16IE_MASK                       0x00000001
#define _CNEN2_CN16IE_LENGTH                     0x00000001

#define _CNEN2_CN17IE_POSITION                   0x00000001
#define _CNEN2_CN17IE_MASK                       0x00000002
#define _CNEN2_CN17IE_LENGTH                     0x00000001

#define _CNEN2_CN18IE_POSITION                   0x00000002
#define _CNEN2_CN18IE_MASK                       0x00000004
#define _CNEN2_CN18IE_LENGTH                     0x00000001

#define _CNEN2_CN19IE_POSITION                   0x00000003
#define _CNEN2_CN19IE_MASK                       0x00000008
#define _CNEN2_CN19IE_LENGTH                     0x00000001

#define _CNEN2_CN20IE_POSITION                   0x00000004
#define _CNEN2_CN20IE_MASK                       0x00000010
#define _CNEN2_CN20IE_LENGTH                     0x00000001

#define _CNEN2_CN21IE_POSITION                   0x00000005
#define _CNEN2_CN21IE_MASK                       0x00000020
#define _CNEN2_CN21IE_LENGTH                     0x00000001

#define _CNEN2_CN22IE_POSITION                   0x00000006
#define _CNEN2_CN22IE_MASK                       0x00000040
#define _CNEN2_CN22IE_LENGTH                     0x00000001

#define _CNEN2_CN23IE_POSITION                   0x00000007
#define _CNEN2_CN23IE_MASK                       0x00000080
#define _CNEN2_CN23IE_LENGTH                     0x00000001

#define _CNEN2_CN24IE_POSITION                   0x00000008
#define _CNEN2_CN24IE_MASK                       0x00000100
#define _CNEN2_CN24IE_LENGTH                     0x00000001

#define _CNEN2_CN25IE_POSITION                   0x00000009
#define _CNEN2_CN25IE_MASK                       0x00000200
#define _CNEN2_CN25IE_LENGTH                     0x00000001

#define _CNEN2_CN30IE_POSITION                   0x0000000E
#define _CNEN2_CN30IE_MASK                       0x00004000
#define _CNEN2_CN30IE_LENGTH                     0x00000001

#define _CNEN2_CN31IE_POSITION                   0x0000000F
#define _CNEN2_CN31IE_MASK                       0x00008000
#define _CNEN2_CN31IE_LENGTH                     0x00000001

#define _CNEN3_CN32IE_POSITION                   0x00000000
#define _CNEN3_CN32IE_MASK                       0x00000001
#define _CNEN3_CN32IE_LENGTH                     0x00000001

#define _CNEN3_CN33IE_POSITION                   0x00000001
#define _CNEN3_CN33IE_MASK                       0x00000002
#define _CNEN3_CN33IE_LENGTH                     0x00000001

#define _CNEN3_CN34IE_POSITION                   0x00000002
#define _CNEN3_CN34IE_MASK                       0x00000004
#define _CNEN3_CN34IE_LENGTH                     0x00000001

#define _CNEN3_CN35IE_POSITION                   0x00000003
#define _CNEN3_CN35IE_MASK                       0x00000008
#define _CNEN3_CN35IE_LENGTH                     0x00000001

#define _CNEN3_CN36IE_POSITION                   0x00000004
#define _CNEN3_CN36IE_MASK                       0x00000010
#define _CNEN3_CN36IE_LENGTH                     0x00000001

#define _CNEN3_CN37IE_POSITION                   0x00000005
#define _CNEN3_CN37IE_MASK                       0x00000020
#define _CNEN3_CN37IE_LENGTH                     0x00000001

#define _CNEN3_CN38IE_POSITION                   0x00000006
#define _CNEN3_CN38IE_MASK                       0x00000040
#define _CNEN3_CN38IE_LENGTH                     0x00000001

#define _CNEN3_CN39IE_POSITION                   0x00000007
#define _CNEN3_CN39IE_MASK                       0x00000080
#define _CNEN3_CN39IE_LENGTH                     0x00000001

#define _CNEN3_CN40IE_POSITION                   0x00000008
#define _CNEN3_CN40IE_MASK                       0x00000100
#define _CNEN3_CN40IE_LENGTH                     0x00000001

#define _CNEN3_CN41IE_POSITION                   0x00000009
#define _CNEN3_CN41IE_MASK                       0x00000200
#define _CNEN3_CN41IE_LENGTH                     0x00000001

#define _CNEN3_CN42IE_POSITION                   0x0000000A
#define _CNEN3_CN42IE_MASK                       0x00000400
#define _CNEN3_CN42IE_LENGTH                     0x00000001

#define _CNEN3_CN43IE_POSITION                   0x0000000B
#define _CNEN3_CN43IE_MASK                       0x00000800
#define _CNEN3_CN43IE_LENGTH                     0x00000001

#define _CNEN3_CN44IE_POSITION                   0x0000000C
#define _CNEN3_CN44IE_MASK                       0x00001000
#define _CNEN3_CN44IE_LENGTH                     0x00000001

#define _CNEN3_CN45IE_POSITION                   0x0000000D
#define _CNEN3_CN45IE_MASK                       0x00002000
#define _CNEN3_CN45IE_LENGTH                     0x00000001

#define _CNEN3_CN46IE_POSITION                   0x0000000E
#define _CNEN3_CN46IE_MASK                       0x00004000
#define _CNEN3_CN46IE_LENGTH                     0x00000001

#define _CNEN3_CN47IE_POSITION                   0x0000000F
#define _CNEN3_CN47IE_MASK                       0x00008000
#define _CNEN3_CN47IE_LENGTH                     0x00000001

#define _CNEN4_CN48IE_POSITION                   0x00000000
#define _CNEN4_CN48IE_MASK                       0x00000001
#define _CNEN4_CN48IE_LENGTH                     0x00000001

#define _CNEN4_CN49IE_POSITION                   0x00000001
#define _CNEN4_CN49IE_MASK                       0x00000002
#define _CNEN4_CN49IE_LENGTH                     0x00000001

#define _CNEN4_CN50IE_POSITION                   0x00000002
#define _CNEN4_CN50IE_MASK                       0x00000004
#define _CNEN4_CN50IE_LENGTH                     0x00000001

#define _CNEN4_CN51IE_POSITION                   0x00000003
#define _CNEN4_CN51IE_MASK                       0x00000008
#define _CNEN4_CN51IE_LENGTH                     0x00000001

