MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
#define _ADTBL28_ADCH4_POSITION                  0x00000004
#define _ADTBL28_ADCH4_MASK                      0x00000010
#define _ADTBL28_ADCH4_LENGTH                    0x00000001

#define _ADTBL28_ADCH5_POSITION                  0x00000005
#define _ADTBL28_ADCH5_MASK                      0x00000020
#define _ADTBL28_ADCH5_LENGTH                    0x00000001

#define _ADTBL28_ADCH6_POSITION                  0x00000006
#define _ADTBL28_ADCH6_MASK                      0x00000040
#define _ADTBL28_ADCH6_LENGTH                    0x00000001

#define _ADTBL29_ADCH_POSITION                   0x00000000
#define _ADTBL29_ADCH_MASK                       0x0000007F
#define _ADTBL29_ADCH_LENGTH                     0x00000007

#define _ADTBL29_DIFF_POSITION                   0x0000000E
#define _ADTBL29_DIFF_MASK                       0x00004000
#define _ADTBL29_DIFF_LENGTH                     0x00000001

#define _ADTBL29_UCTMU_POSITION                  0x0000000F
#define _ADTBL29_UCTMU_MASK                      0x00008000
#define _ADTBL29_UCTMU_LENGTH                    0x00000001

#define _ADTBL29_ADCH0_POSITION                  0x00000000
#define _ADTBL29_ADCH0_MASK                      0x00000001
#define _ADTBL29_ADCH0_LENGTH                    0x00000001

#define _ADTBL29_ADCH1_POSITION                  0x00000001
#define _ADTBL29_ADCH1_MASK                      0x00000002
#define _ADTBL29_ADCH1_LENGTH                    0x00000001

#define _ADTBL29_ADCH2_POSITION                  0x00000002
#define _ADTBL29_ADCH2_MASK                      0x00000004
#define _ADTBL29_ADCH2_LENGTH                    0x00000001

#define _ADTBL29_ADCH3_POSITION                  0x00000003
#define _ADTBL29_ADCH3_MASK                      0x00000008
#define _ADTBL29_ADCH3_LENGTH                    0x00000001

#define _ADTBL29_ADCH4_POSITION                  0x00000004
#define _ADTBL29_ADCH4_MASK                      0x00000010
#define _ADTBL29_ADCH4_LENGTH                    0x00000001

#define _ADTBL29_ADCH5_POSITION                  0x00000005
#define _ADTBL29_ADCH5_MASK                      0x00000020
#define _ADTBL29_ADCH5_LENGTH                    0x00000001

#define _ADTBL29_ADCH6_POSITION                  0x00000006
#define _ADTBL29_ADCH6_MASK                      0x00000040
#define _ADTBL29_ADCH6_LENGTH                    0x00000001

#define _ADTBL30_ADCH_POSITION                   0x00000000
#define _ADTBL30_ADCH_MASK                       0x0000007F
#define _ADTBL30_ADCH_LENGTH                     0x00000007

#define _ADTBL30_DIFF_POSITION                   0x0000000E
#define _ADTBL30_DIFF_MASK                       0x00004000
#define _ADTBL30_DIFF_LENGTH                     0x00000001

#define _ADTBL30_UCTMU_POSITION                  0x0000000F
#define _ADTBL30_UCTMU_MASK                      0x00008000
#define _ADTBL30_UCTMU_LENGTH                    0x00000001

#define _ADTBL30_ADCH0_POSITION                  0x00000000
#define _ADTBL30_ADCH0_MASK                      0x00000001
#define _ADTBL30_ADCH0_LENGTH                    0x00000001

#define _ADTBL30_ADCH1_POSITION                  0x00000001
#define _ADTBL30_ADCH1_MASK                      0x00000002
#define _ADTBL30_ADCH1_LENGTH                    0x00000001

#define _ADTBL30_ADCH2_POSITION                  0x00000002
#define _ADTBL30_ADCH2_MASK                      0x00000004
#define _ADTBL30_ADCH2_LENGTH                    0x00000001

#define _ADTBL30_ADCH3_POSITION                  0x00000003
#define _ADTBL30_ADCH3_MASK                      0x00000008
#define _ADTBL30_ADCH3_LENGTH                    0x00000001

#define _ADTBL30_ADCH4_POSITION                  0x00000004
#define _ADTBL30_ADCH4_MASK                      0x00000010
#define _ADTBL30_ADCH4_LENGTH                    0x00000001

#define _ADTBL30_ADCH5_POSITION                  0x00000005
#define _ADTBL30_ADCH5_MASK                      0x00000020
#define _ADTBL30_ADCH5_LENGTH                    0x00000001

#define _ADTBL30_ADCH6_POSITION                  0x00000006
#define _ADTBL30_ADCH6_MASK                      0x00000040
#define _ADTBL30_ADCH6_LENGTH                    0x00000001

#define _ADTBL31_ADCH_POSITION                   0x00000000
#define _ADTBL31_ADCH_MASK                       0x0000007F
#define _ADTBL31_ADCH_LENGTH                     0x00000007

#define _ADTBL31_DIFF_POSITION                   0x0000000E
#define _ADTBL31_DIFF_MASK                       0x00004000
#define _ADTBL31_DIFF_LENGTH                     0x00000001

#define _ADTBL31_UCTMU_POSITION                  0x0000000F
#define _ADTBL31_UCTMU_MASK                      0x00008000
#define _ADTBL31_UCTMU_LENGTH                    0x00000001

#define _ADTBL31_ADCH0_POSITION                  0x00000000
#define _ADTBL31_ADCH0_MASK                      0x00000001
#define _ADTBL31_ADCH0_LENGTH                    0x00000001

#define _ADTBL31_ADCH1_POSITION                  0x00000001
#define _ADTBL31_ADCH1_MASK                      0x00000002
#define _ADTBL31_ADCH1_LENGTH                    0x00000001

#define _ADTBL31_ADCH2_POSITION                  0x00000002
#define _ADTBL31_ADCH2_MASK                      0x00000004
#define _ADTBL31_ADCH2_LENGTH                    0x00000001

#define _ADTBL31_ADCH3_POSITION                  0x00000003
#define _ADTBL31_ADCH3_MASK                      0x00000008
#define _ADTBL31_ADCH3_LENGTH                    0x00000001

#define _ADTBL31_ADCH4_POSITION                  0x00000004
#define _ADTBL31_ADCH4_MASK                      0x00000010
#define _ADTBL31_ADCH4_LENGTH                    0x00000001

#define _ADTBL31_ADCH5_POSITION                  0x00000005
#define _ADTBL31_ADCH5_MASK                      0x00000020
#define _ADTBL31_ADCH5_LENGTH                    0x00000001

#define _ADTBL31_ADCH6_POSITION                  0x00000006
#define _ADTBL31_ADCH6_MASK                      0x00000040
#define _ADTBL31_ADCH6_LENGTH                    0x00000001

#define _DMACON_PRSSEL_POSITION                  0x00000000
#define _DMACON_PRSSEL_MASK                      0x00000001
#define _DMACON_PRSSEL_LENGTH                    0x00000001

#define _DMACON_DMAEN_POSITION                   0x0000000F
#define _DMACON_DMAEN_MASK                       0x00008000
#define _DMACON_DMAEN_LENGTH                     0x00000001

#define _DMACH0_CHEN_POSITION                    0x00000000
#define _DMACH0_CHEN_MASK                        0x00000001
#define _DMACH0_CHEN_LENGTH                      0x00000001

#define _DMACH0_SIZE_POSITION                    0x00000001
#define _DMACH0_SIZE_MASK                        0x00000002
#define _DMACH0_SIZE_LENGTH                      0x00000001

#define _DMACH0_TRMODE_POSITION                  0x00000002
#define _DMACH0_TRMODE_MASK                      0x0000000C
#define _DMACH0_TRMODE_LENGTH                    0x00000002

#define _DMACH0_DAMODE_POSITION                  0x00000004
#define _DMACH0_DAMODE_MASK                      0x00000030
#define _DMACH0_DAMODE_LENGTH                    0x00000002

#define _DMACH0_SAMODE_POSITION                  0x00000006
#define _DMACH0_SAMODE_MASK                      0x000000C0
#define _DMACH0_SAMODE_LENGTH                    0x00000002

#define _DMACH0_CHREQ_POSITION                   0x00000008
#define _DMACH0_CHREQ_MASK                       0x00000100
#define _DMACH0_CHREQ_LENGTH                     0x00000001

#define _DMACH0_RELOAD_POSITION                  0x00000009
#define _DMACH0_RELOAD_MASK                      0x00000200
#define _DMACH0_RELOAD_LENGTH                    0x00000001

#define _DMACH0_NULLW_POSITION                   0x0000000A
#define _DMACH0_NULLW_MASK                       0x00000400
#define _DMACH0_NULLW_LENGTH                     0x00000001

