MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
#define _ADL3MSEL1_MSEL27_POSITION               0x0000000B
#define _ADL3MSEL1_MSEL27_MASK                   0x00000800
#define _ADL3MSEL1_MSEL27_LENGTH                 0x00000001

#define _ADL3MSEL1_MSEL28_POSITION               0x0000000C
#define _ADL3MSEL1_MSEL28_MASK                   0x00001000
#define _ADL3MSEL1_MSEL28_LENGTH                 0x00000001

#define _ADL3MSEL1_MSEL29_POSITION               0x0000000D
#define _ADL3MSEL1_MSEL29_MASK                   0x00002000
#define _ADL3MSEL1_MSEL29_LENGTH                 0x00000001

#define _ADL3MSEL1_MSEL30_POSITION               0x0000000E
#define _ADL3MSEL1_MSEL30_MASK                   0x00004000
#define _ADL3MSEL1_MSEL30_LENGTH                 0x00000001

#define _ADL3MSEL1_MSEL31_POSITION               0x0000000F
#define _ADL3MSEL1_MSEL31_MASK                   0x00008000
#define _ADL3MSEL1_MSEL31_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL32_POSITION               0x00000000
#define _ADL3MSEL2_MSEL32_MASK                   0x00000001
#define _ADL3MSEL2_MSEL32_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL33_POSITION               0x00000001
#define _ADL3MSEL2_MSEL33_MASK                   0x00000002
#define _ADL3MSEL2_MSEL33_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL34_POSITION               0x00000002
#define _ADL3MSEL2_MSEL34_MASK                   0x00000004
#define _ADL3MSEL2_MSEL34_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL35_POSITION               0x00000003
#define _ADL3MSEL2_MSEL35_MASK                   0x00000008
#define _ADL3MSEL2_MSEL35_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL36_POSITION               0x00000004
#define _ADL3MSEL2_MSEL36_MASK                   0x00000010
#define _ADL3MSEL2_MSEL36_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL37_POSITION               0x00000005
#define _ADL3MSEL2_MSEL37_MASK                   0x00000020
#define _ADL3MSEL2_MSEL37_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL38_POSITION               0x00000006
#define _ADL3MSEL2_MSEL38_MASK                   0x00000040
#define _ADL3MSEL2_MSEL38_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL39_POSITION               0x00000007
#define _ADL3MSEL2_MSEL39_MASK                   0x00000080
#define _ADL3MSEL2_MSEL39_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL40_POSITION               0x00000008
#define _ADL3MSEL2_MSEL40_MASK                   0x00000100
#define _ADL3MSEL2_MSEL40_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL41_POSITION               0x00000009
#define _ADL3MSEL2_MSEL41_MASK                   0x00000200
#define _ADL3MSEL2_MSEL41_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL42_POSITION               0x0000000A
#define _ADL3MSEL2_MSEL42_MASK                   0x00000400
#define _ADL3MSEL2_MSEL42_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL43_POSITION               0x0000000B
#define _ADL3MSEL2_MSEL43_MASK                   0x00000800
#define _ADL3MSEL2_MSEL43_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL44_POSITION               0x0000000C
#define _ADL3MSEL2_MSEL44_MASK                   0x00001000
#define _ADL3MSEL2_MSEL44_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL45_POSITION               0x0000000D
#define _ADL3MSEL2_MSEL45_MASK                   0x00002000
#define _ADL3MSEL2_MSEL45_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL46_POSITION               0x0000000E
#define _ADL3MSEL2_MSEL46_MASK                   0x00004000
#define _ADL3MSEL2_MSEL46_LENGTH                 0x00000001

#define _ADL3MSEL2_MSEL47_POSITION               0x0000000F
#define _ADL3MSEL2_MSEL47_MASK                   0x00008000
#define _ADL3MSEL2_MSEL47_LENGTH                 0x00000001

#define _ADL3MSEL3_MSEL48_POSITION               0x00000000
#define _ADL3MSEL3_MSEL48_MASK                   0x00000001
#define _ADL3MSEL3_MSEL48_LENGTH                 0x00000001

#define _ADL3MSEL3_MSEL49_POSITION               0x00000001
#define _ADL3MSEL3_MSEL49_MASK                   0x00000002
#define _ADL3MSEL3_MSEL49_LENGTH                 0x00000001

#define _DAC1CON_DACREF_POSITION                 0x00000000
#define _DAC1CON_DACREF_MASK                     0x00000003
#define _DAC1CON_DACREF_LENGTH                   0x00000002

#define _DAC1CON_DACTSEL_POSITION                0x00000002
#define _DAC1CON_DACTSEL_MASK                    0x0000007C
#define _DAC1CON_DACTSEL_LENGTH                  0x00000005

#define _DAC1CON_DACTRIG_POSITION                0x00000008
#define _DAC1CON_DACTRIG_MASK                    0x00000100
#define _DAC1CON_DACTRIG_LENGTH                  0x00000001

#define _DAC1CON_DACFM_POSITION                  0x0000000B
#define _DAC1CON_DACFM_MASK                      0x00000800
#define _DAC1CON_DACFM_LENGTH                    0x00000001

#define _DAC1CON_DACSLP_POSITION                 0x0000000C
#define _DAC1CON_DACSLP_MASK                     0x00001000
#define _DAC1CON_DACSLP_LENGTH                   0x00000001

#define _DAC1CON_DACSIDL_POSITION                0x0000000D
#define _DAC1CON_DACSIDL_MASK                    0x00002000
#define _DAC1CON_DACSIDL_LENGTH                  0x00000001

#define _DAC1CON_DACEN_POSITION                  0x0000000F
#define _DAC1CON_DACEN_MASK                      0x00008000
#define _DAC1CON_DACEN_LENGTH                    0x00000001

#define _DAC1CON_REFSEL0_POSITION                0x00000000
#define _DAC1CON_REFSEL0_MASK                    0x00000001
#define _DAC1CON_REFSEL0_LENGTH                  0x00000001

#define _DAC1CON_REFSEL1_POSITION                0x00000001
#define _DAC1CON_REFSEL1_MASK                    0x00000002
#define _DAC1CON_REFSEL1_LENGTH                  0x00000001

#define _DAC1CON_DACTSEL0_POSITION               0x00000002
#define _DAC1CON_DACTSEL0_MASK                   0x00000004
#define _DAC1CON_DACTSEL0_LENGTH                 0x00000001

#define _DAC1CON_DACTSEL1_POSITION               0x00000003
#define _DAC1CON_DACTSEL1_MASK                   0x00000008
#define _DAC1CON_DACTSEL1_LENGTH                 0x00000001

#define _DAC1CON_DACTSEL2_POSITION               0x00000004
#define _DAC1CON_DACTSEL2_MASK                   0x00000010
#define _DAC1CON_DACTSEL2_LENGTH                 0x00000001

#define _DAC1CON_DACTSEL3_POSITION               0x00000005
#define _DAC1CON_DACTSEL3_MASK                   0x00000020
#define _DAC1CON_DACTSEL3_LENGTH                 0x00000001

#define _DAC1CON_DACTSEL4_POSITION               0x00000006
#define _DAC1CON_DACTSEL4_MASK                   0x00000040
#define _DAC1CON_DACTSEL4_LENGTH                 0x00000001

#define _DAC2CON_DACREF_POSITION                 0x00000000
#define _DAC2CON_DACREF_MASK                     0x00000003
#define _DAC2CON_DACREF_LENGTH                   0x00000002

#define _DAC2CON_DACTSEL_POSITION                0x00000002
#define _DAC2CON_DACTSEL_MASK                    0x0000007C
#define _DAC2CON_DACTSEL_LENGTH                  0x00000005

#define _DAC2CON_DACTRIG_POSITION                0x00000008
#define _DAC2CON_DACTRIG_MASK                    0x00000100
#define _DAC2CON_DACTRIG_LENGTH                  0x00000001

#define _DAC2CON_DACFM_POSITION                  0x0000000B
#define _DAC2CON_DACFM_MASK                      0x00000800
#define _DAC2CON_DACFM_LENGTH                    0x00000001

#define _DAC2CON_DACSLP_POSITION                 0x0000000C
#define _DAC2CON_DACSLP_MASK                     0x00001000
#define _DAC2CON_DACSLP_LENGTH                   0x00000001

