MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
#define _ANSELE_ANSE4_POSITION                   0x00000004
#define _ANSELE_ANSE4_MASK                       0x00000010
#define _ANSELE_ANSE4_LENGTH                     0x00000001

#define _ANSELE_ANSE5_POSITION                   0x00000005
#define _ANSELE_ANSE5_MASK                       0x00000020
#define _ANSELE_ANSE5_LENGTH                     0x00000001

#define _ANSELE_ANSE6_POSITION                   0x00000006
#define _ANSELE_ANSE6_MASK                       0x00000040
#define _ANSELE_ANSE6_LENGTH                     0x00000001

#define _ANSELE_ANSE7_POSITION                   0x00000007
#define _ANSELE_ANSE7_MASK                       0x00000080
#define _ANSELE_ANSE7_LENGTH                     0x00000001

#define _ANSELE_ANSE9_POSITION                   0x00000009
#define _ANSELE_ANSE9_MASK                       0x00000200
#define _ANSELE_ANSE9_LENGTH                     0x00000001

#define _ANSELE_ANSELE4_POSITION                 0x00000004
#define _ANSELE_ANSELE4_MASK                     0x00000010
#define _ANSELE_ANSELE4_LENGTH                   0x00000001

#define _ANSELE_ANSELE5_POSITION                 0x00000005
#define _ANSELE_ANSELE5_MASK                     0x00000020
#define _ANSELE_ANSELE5_LENGTH                   0x00000001

#define _ANSELE_ANSELE6_POSITION                 0x00000006
#define _ANSELE_ANSELE6_MASK                     0x00000040
#define _ANSELE_ANSELE6_LENGTH                   0x00000001

#define _ANSELE_ANSELE7_POSITION                 0x00000007
#define _ANSELE_ANSELE7_MASK                     0x00000080
#define _ANSELE_ANSELE7_LENGTH                   0x00000001

#define _ANSELE_ANSELE9_POSITION                 0x00000009
#define _ANSELE_ANSELE9_MASK                     0x00000200
#define _ANSELE_ANSELE9_LENGTH                   0x00000001

#define _ANSELF_ANSF0_POSITION                   0x00000000
#define _ANSELF_ANSF0_MASK                       0x00000001
#define _ANSELF_ANSF0_LENGTH                     0x00000001

#define _ANSELF_ANSF2_POSITION                   0x00000002
#define _ANSELF_ANSF2_MASK                       0x00000004
#define _ANSELF_ANSF2_LENGTH                     0x00000001

#define _ANSELF_ANSF3_POSITION                   0x00000003
#define _ANSELF_ANSF3_MASK                       0x00000008
#define _ANSELF_ANSF3_LENGTH                     0x00000001

#define _ANSELF_ANSF4_POSITION                   0x00000004
#define _ANSELF_ANSF4_MASK                       0x00000010
#define _ANSELF_ANSF4_LENGTH                     0x00000001

#define _ANSELF_ANSF5_POSITION                   0x00000005
#define _ANSELF_ANSF5_MASK                       0x00000020
#define _ANSELF_ANSF5_LENGTH                     0x00000001

#define _ANSELF_ANSF7_POSITION                   0x00000007
#define _ANSELF_ANSF7_MASK                       0x00000080
#define _ANSELF_ANSF7_LENGTH                     0x00000001

#define _ANSELF_ANSF8_POSITION                   0x00000008
#define _ANSELF_ANSF8_MASK                       0x00000100
#define _ANSELF_ANSF8_LENGTH                     0x00000001

#define _ANSELF_ANSF13_POSITION                  0x0000000D
#define _ANSELF_ANSF13_MASK                      0x00002000
#define _ANSELF_ANSF13_LENGTH                    0x00000001

#define _ANSELF_ANSELF0_POSITION                 0x00000000
#define _ANSELF_ANSELF0_MASK                     0x00000001
#define _ANSELF_ANSELF0_LENGTH                   0x00000001

#define _ANSELF_ANSELF2_POSITION                 0x00000002
#define _ANSELF_ANSELF2_MASK                     0x00000004
#define _ANSELF_ANSELF2_LENGTH                   0x00000001

#define _ANSELF_ANSELF3_POSITION                 0x00000003
#define _ANSELF_ANSELF3_MASK                     0x00000008
#define _ANSELF_ANSELF3_LENGTH                   0x00000001

#define _ANSELF_ANSELF4_POSITION                 0x00000004
#define _ANSELF_ANSELF4_MASK                     0x00000010
#define _ANSELF_ANSELF4_LENGTH                   0x00000001

#define _ANSELF_ANSELF5_POSITION                 0x00000005
#define _ANSELF_ANSELF5_MASK                     0x00000020
#define _ANSELF_ANSELF5_LENGTH                   0x00000001

#define _ANSELF_ANSELF7_POSITION                 0x00000007
#define _ANSELF_ANSELF7_MASK                     0x00000080
#define _ANSELF_ANSELF7_LENGTH                   0x00000001

#define _ANSELF_ANSELF8_POSITION                 0x00000008
#define _ANSELF_ANSELF8_MASK                     0x00000100
#define _ANSELF_ANSELF8_LENGTH                   0x00000001

#define _ANSELF_ANSELF13_POSITION                0x0000000D
#define _ANSELF_ANSELF13_MASK                    0x00002000
#define _ANSELF_ANSELF13_LENGTH                  0x00000001

#define _ANSF_ANSF0_POSITION                     0x00000000
#define _ANSF_ANSF0_MASK                         0x00000001
#define _ANSF_ANSF0_LENGTH                       0x00000001

#define _ANSF_ANSF2_POSITION                     0x00000002
#define _ANSF_ANSF2_MASK                         0x00000004
#define _ANSF_ANSF2_LENGTH                       0x00000001

#define _ANSF_ANSF3_POSITION                     0x00000003
#define _ANSF_ANSF3_MASK                         0x00000008
#define _ANSF_ANSF3_LENGTH                       0x00000001

#define _ANSF_ANSF4_POSITION                     0x00000004
#define _ANSF_ANSF4_MASK                         0x00000010
#define _ANSF_ANSF4_LENGTH                       0x00000001

#define _ANSF_ANSF5_POSITION                     0x00000005
#define _ANSF_ANSF5_MASK                         0x00000020
#define _ANSF_ANSF5_LENGTH                       0x00000001

#define _ANSF_ANSF7_POSITION                     0x00000007
#define _ANSF_ANSF7_MASK                         0x00000080
#define _ANSF_ANSF7_LENGTH                       0x00000001

#define _ANSF_ANSF8_POSITION                     0x00000008
#define _ANSF_ANSF8_MASK                         0x00000100
#define _ANSF_ANSF8_LENGTH                       0x00000001

#define _ANSF_ANSF13_POSITION                    0x0000000D
#define _ANSF_ANSF13_MASK                        0x00002000
#define _ANSF_ANSF13_LENGTH                      0x00000001

