MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
#define _LCDSE1_SE19_POSITION                    0x00000003
#define _LCDSE1_SE19_MASK                        0x00000008
#define _LCDSE1_SE19_LENGTH                      0x00000001

#define _LCDSE1_SE20_POSITION                    0x00000004
#define _LCDSE1_SE20_MASK                        0x00000010
#define _LCDSE1_SE20_LENGTH                      0x00000001

#define _LCDSE1_SE21_POSITION                    0x00000005
#define _LCDSE1_SE21_MASK                        0x00000020
#define _LCDSE1_SE21_LENGTH                      0x00000001

#define _LCDSE1_SE22_POSITION                    0x00000006
#define _LCDSE1_SE22_MASK                        0x00000040
#define _LCDSE1_SE22_LENGTH                      0x00000001

#define _LCDSE1_SE23_POSITION                    0x00000007
#define _LCDSE1_SE23_MASK                        0x00000080
#define _LCDSE1_SE23_LENGTH                      0x00000001

#define _LCDSE1_SE24_POSITION                    0x00000008
#define _LCDSE1_SE24_MASK                        0x00000100
#define _LCDSE1_SE24_LENGTH                      0x00000001

#define _LCDSE1_SE25_POSITION                    0x00000009
#define _LCDSE1_SE25_MASK                        0x00000200
#define _LCDSE1_SE25_LENGTH                      0x00000001

#define _LCDSE1_SE26_POSITION                    0x0000000A
#define _LCDSE1_SE26_MASK                        0x00000400
#define _LCDSE1_SE26_LENGTH                      0x00000001

#define _LCDSE1_SE27_POSITION                    0x0000000B
#define _LCDSE1_SE27_MASK                        0x00000800
#define _LCDSE1_SE27_LENGTH                      0x00000001

#define _LCDSE1_SE28_POSITION                    0x0000000C
#define _LCDSE1_SE28_MASK                        0x00001000
#define _LCDSE1_SE28_LENGTH                      0x00000001

#define _LCDSE1_SE29_POSITION                    0x0000000D
#define _LCDSE1_SE29_MASK                        0x00002000
#define _LCDSE1_SE29_LENGTH                      0x00000001

#define _LCDSE1_SE30_POSITION                    0x0000000E
#define _LCDSE1_SE30_MASK                        0x00004000
#define _LCDSE1_SE30_LENGTH                      0x00000001

#define _LCDSE1_SE31_POSITION                    0x0000000F
#define _LCDSE1_SE31_MASK                        0x00008000
#define _LCDSE1_SE31_LENGTH                      0x00000001

#define _LCDSE2_SE32_POSITION                    0x00000000
#define _LCDSE2_SE32_MASK                        0x00000001
#define _LCDSE2_SE32_LENGTH                      0x00000001

#define _LCDSE2_SE33_POSITION                    0x00000001
#define _LCDSE2_SE33_MASK                        0x00000002
#define _LCDSE2_SE33_LENGTH                      0x00000001

#define _LCDSE2_SE34_POSITION                    0x00000002
#define _LCDSE2_SE34_MASK                        0x00000004
#define _LCDSE2_SE34_LENGTH                      0x00000001

#define _LCDSE2_SE35_POSITION                    0x00000003
#define _LCDSE2_SE35_MASK                        0x00000008
#define _LCDSE2_SE35_LENGTH                      0x00000001

#define _LCDSE2_SE36_POSITION                    0x00000004
#define _LCDSE2_SE36_MASK                        0x00000010
#define _LCDSE2_SE36_LENGTH                      0x00000001

#define _LCDSE2_SE37_POSITION                    0x00000005
#define _LCDSE2_SE37_MASK                        0x00000020
#define _LCDSE2_SE37_LENGTH                      0x00000001

#define _LCDSE2_SE38_POSITION                    0x00000006
#define _LCDSE2_SE38_MASK                        0x00000040
#define _LCDSE2_SE38_LENGTH                      0x00000001

#define _LCDSE2_SE39_POSITION                    0x00000007
#define _LCDSE2_SE39_MASK                        0x00000080
#define _LCDSE2_SE39_LENGTH                      0x00000001

#define _LCDSE2_SE40_POSITION                    0x00000008
#define _LCDSE2_SE40_MASK                        0x00000100
#define _LCDSE2_SE40_LENGTH                      0x00000001

#define _LCDSE2_SE41_POSITION                    0x00000009
#define _LCDSE2_SE41_MASK                        0x00000200
#define _LCDSE2_SE41_LENGTH                      0x00000001

#define _LCDSE2_SE42_POSITION                    0x0000000A
#define _LCDSE2_SE42_MASK                        0x00000400
#define _LCDSE2_SE42_LENGTH                      0x00000001

#define _LCDSE2_SE43_POSITION                    0x0000000B
#define _LCDSE2_SE43_MASK                        0x00000800
#define _LCDSE2_SE43_LENGTH                      0x00000001

#define _LCDSE2_SE44_POSITION                    0x0000000C
#define _LCDSE2_SE44_MASK                        0x00001000
#define _LCDSE2_SE44_LENGTH                      0x00000001

#define _LCDSE2_SE45_POSITION                    0x0000000D
#define _LCDSE2_SE45_MASK                        0x00002000
#define _LCDSE2_SE45_LENGTH                      0x00000001

#define _LCDSE2_SE46_POSITION                    0x0000000E
#define _LCDSE2_SE46_MASK                        0x00004000
#define _LCDSE2_SE46_LENGTH                      0x00000001

#define _LCDSE2_SE47_POSITION                    0x0000000F
#define _LCDSE2_SE47_MASK                        0x00008000
#define _LCDSE2_SE47_LENGTH                      0x00000001

#define _LCDSE3_SE48_POSITION                    0x00000000
#define _LCDSE3_SE48_MASK                        0x00000001
#define _LCDSE3_SE48_LENGTH                      0x00000001

#define _LCDSE3_SE49_POSITION                    0x00000001
#define _LCDSE3_SE49_MASK                        0x00000002
#define _LCDSE3_SE49_LENGTH                      0x00000001

#define _LCDSE3_SE50_POSITION                    0x00000002
#define _LCDSE3_SE50_MASK                        0x00000004
#define _LCDSE3_SE50_LENGTH                      0x00000001

#define _LCDSE3_SE51_POSITION                    0x00000003
#define _LCDSE3_SE51_MASK                        0x00000008
#define _LCDSE3_SE51_LENGTH                      0x00000001

#define _LCDSE3_SE52_POSITION                    0x00000004
#define _LCDSE3_SE52_MASK                        0x00000010
#define _LCDSE3_SE52_LENGTH                      0x00000001

#define _LCDSE3_SE53_POSITION                    0x00000005
#define _LCDSE3_SE53_MASK                        0x00000020
#define _LCDSE3_SE53_LENGTH                      0x00000001

#define _LCDSE3_SE54_POSITION                    0x00000006
#define _LCDSE3_SE54_MASK                        0x00000040
#define _LCDSE3_SE54_LENGTH                      0x00000001

#define _LCDSE3_SE55_POSITION                    0x00000007
#define _LCDSE3_SE55_MASK                        0x00000080
#define _LCDSE3_SE55_LENGTH                      0x00000001

#define _LCDSE3_SE56_POSITION                    0x00000008
#define _LCDSE3_SE56_MASK                        0x00000100
#define _LCDSE3_SE56_LENGTH                      0x00000001

#define _LCDSE3_SE57_POSITION                    0x00000009
#define _LCDSE3_SE57_MASK                        0x00000200
#define _LCDSE3_SE57_LENGTH                      0x00000001

