MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GC010/mcu.h
#define _RPINR27_U4RXR3_POSITION                 0x00000003
#define _RPINR27_U4RXR3_MASK                     0x00000008
#define _RPINR27_U4RXR3_LENGTH                   0x00000001

#define _RPINR27_U4RXR4_POSITION                 0x00000004
#define _RPINR27_U4RXR4_MASK                     0x00000010
#define _RPINR27_U4RXR4_LENGTH                   0x00000001

#define _RPINR27_U4RXR5_POSITION                 0x00000005
#define _RPINR27_U4RXR5_MASK                     0x00000020
#define _RPINR27_U4RXR5_LENGTH                   0x00000001

#define _RPINR27_U4CTSR0_POSITION                0x00000008
#define _RPINR27_U4CTSR0_MASK                    0x00000100
#define _RPINR27_U4CTSR0_LENGTH                  0x00000001

#define _RPINR27_U4CTSR1_POSITION                0x00000009
#define _RPINR27_U4CTSR1_MASK                    0x00000200
#define _RPINR27_U4CTSR1_LENGTH                  0x00000001

#define _RPINR27_U4CTSR2_POSITION                0x0000000A
#define _RPINR27_U4CTSR2_MASK                    0x00000400
#define _RPINR27_U4CTSR2_LENGTH                  0x00000001

#define _RPINR27_U4CTSR3_POSITION                0x0000000B
#define _RPINR27_U4CTSR3_MASK                    0x00000800
#define _RPINR27_U4CTSR3_LENGTH                  0x00000001

#define _RPINR27_U4CTSR4_POSITION                0x0000000C
#define _RPINR27_U4CTSR4_MASK                    0x00001000
#define _RPINR27_U4CTSR4_LENGTH                  0x00000001

#define _RPINR27_U4CTSR5_POSITION                0x0000000D
#define _RPINR27_U4CTSR5_MASK                    0x00002000
#define _RPINR27_U4CTSR5_LENGTH                  0x00000001

#define _RPINR30_MDMIR_POSITION                  0x00000000
#define _RPINR30_MDMIR_MASK                      0x0000003F
#define _RPINR30_MDMIR_LENGTH                    0x00000006

#define _RPINR30_MDMINR_POSITION                 0x00000000
#define _RPINR30_MDMINR_MASK                     0x0000003F
#define _RPINR30_MDMINR_LENGTH                   0x00000006

#define _RPINR31_MDC1R_POSITION                  0x00000000
#define _RPINR31_MDC1R_MASK                      0x0000003F
#define _RPINR31_MDC1R_LENGTH                    0x00000006

#define _RPINR31_MDC2R_POSITION                  0x00000008
#define _RPINR31_MDC2R_MASK                      0x00003F00
#define _RPINR31_MDC2R_LENGTH                    0x00000006

#define _RPINR31_MDC1R0_POSITION                 0x00000000
#define _RPINR31_MDC1R0_MASK                     0x00000001
#define _RPINR31_MDC1R0_LENGTH                   0x00000001

#define _RPINR31_MDC1R1_POSITION                 0x00000001
#define _RPINR31_MDC1R1_MASK                     0x00000002
#define _RPINR31_MDC1R1_LENGTH                   0x00000001

#define _RPINR31_MDC1R2_POSITION                 0x00000002
#define _RPINR31_MDC1R2_MASK                     0x00000004
#define _RPINR31_MDC1R2_LENGTH                   0x00000001

#define _RPINR31_MDC1R3_POSITION                 0x00000003
#define _RPINR31_MDC1R3_MASK                     0x00000008
#define _RPINR31_MDC1R3_LENGTH                   0x00000001

#define _RPINR31_MDC1R4_POSITION                 0x00000004
#define _RPINR31_MDC1R4_MASK                     0x00000010
#define _RPINR31_MDC1R4_LENGTH                   0x00000001

#define _RPINR31_MDC1R5_POSITION                 0x00000005
#define _RPINR31_MDC1R5_MASK                     0x00000020
#define _RPINR31_MDC1R5_LENGTH                   0x00000001

#define _RPINR31_MDC2R0_POSITION                 0x00000008
#define _RPINR31_MDC2R0_MASK                     0x00000100
#define _RPINR31_MDC2R0_LENGTH                   0x00000001

#define _RPINR31_MDC2R1_POSITION                 0x00000009
#define _RPINR31_MDC2R1_MASK                     0x00000200
#define _RPINR31_MDC2R1_LENGTH                   0x00000001

#define _RPINR31_MDC2R2_POSITION                 0x0000000A
#define _RPINR31_MDC2R2_MASK                     0x00000400
#define _RPINR31_MDC2R2_LENGTH                   0x00000001

#define _RPINR31_MDC2R3_POSITION                 0x0000000B
#define _RPINR31_MDC2R3_MASK                     0x00000800
#define _RPINR31_MDC2R3_LENGTH                   0x00000001

#define _RPINR31_MDC2R4_POSITION                 0x0000000C
#define _RPINR31_MDC2R4_MASK                     0x00001000
#define _RPINR31_MDC2R4_LENGTH                   0x00000001

#define _RPINR31_MDC2R5_POSITION                 0x0000000D
#define _RPINR31_MDC2R5_MASK                     0x00002000
#define _RPINR31_MDC2R5_LENGTH                   0x00000001

#define _RPOR0_RP0R_POSITION                     0x00000000
#define _RPOR0_RP0R_MASK                         0x0000003F
#define _RPOR0_RP0R_LENGTH                       0x00000006

#define _RPOR0_RP1R_POSITION                     0x00000008
#define _RPOR0_RP1R_MASK                         0x00003F00
#define _RPOR0_RP1R_LENGTH                       0x00000006

#define _RPOR0_RP0R0_POSITION                    0x00000000
#define _RPOR0_RP0R0_MASK                        0x00000001
#define _RPOR0_RP0R0_LENGTH                      0x00000001

#define _RPOR0_RP0R1_POSITION                    0x00000001
#define _RPOR0_RP0R1_MASK                        0x00000002
#define _RPOR0_RP0R1_LENGTH                      0x00000001

#define _RPOR0_RP0R2_POSITION                    0x00000002
#define _RPOR0_RP0R2_MASK                        0x00000004
#define _RPOR0_RP0R2_LENGTH                      0x00000001

#define _RPOR0_RP0R3_POSITION                    0x00000003
#define _RPOR0_RP0R3_MASK                        0x00000008
#define _RPOR0_RP0R3_LENGTH                      0x00000001

#define _RPOR0_RP0R4_POSITION                    0x00000004
#define _RPOR0_RP0R4_MASK                        0x00000010
#define _RPOR0_RP0R4_LENGTH                      0x00000001

#define _RPOR0_RP0R5_POSITION                    0x00000005
#define _RPOR0_RP0R5_MASK                        0x00000020
#define _RPOR0_RP0R5_LENGTH                      0x00000001

#define _RPOR0_RP1R0_POSITION                    0x00000008
#define _RPOR0_RP1R0_MASK                        0x00000100
#define _RPOR0_RP1R0_LENGTH                      0x00000001

#define _RPOR0_RP1R1_POSITION                    0x00000009
#define _RPOR0_RP1R1_MASK                        0x00000200
#define _RPOR0_RP1R1_LENGTH                      0x00000001

